src/frontend/controllers/CheatsController.php

	public function actionRateadd($name, $message, $stars, $productid)
	{
			$model = new User();
		  $this->layout = 'index2';
			$userid = $model->
			getByUsername(Yii::$app->request->cookies->getValue("username"));
			$uid = $userid->id;
			$rate = new Rates();
			$rate->id = NULL;
			$rate->userid = $uid;
			$rate->product_id = $productid;
			$rate->stars = $stars;
			$rate->message = $message;
			$rate->time_published = date("Y-m-d H:i:s", time());
			$result = $rate->save();
---
INSERT INTO `rates` (`id`, `userid`, `product_id`, `stars`, `message`, `time_published`) VALUES (NULL, 31, 5, 5, 'hello world', '2021-02-23 17:04:35')