src/frontend/controllers/MarketController.php

    public function actionIndex()
    {
        $pagination = new Pagination([
          'defaultPageSize' => 20,
          'totalCount' => Salles::find()->count(),
        ]);
        $res = Salles::find()
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `salles`
SELECT * FROM `salles` LIMIT 20 OFFSET 20

    public function actionHack($id = 0)
    {
        $data = Salles::findOne(['id' => $id]);
        $author = Users::findOne(['id' => $data['author_id']]);
        $category = Category::findOne(['id' => $data['category_id']]);
        $users_rate = [];
        $rates = Rates::findAll(['product_id' => $id]);
        for ($i = 0; $i < count($rates); $i++) {
            $user = Users::findOne(['id' => $rates[$i]['userid']]);
---
SELECT * FROM `salles` WHERE `id`='1'
SELECT * FROM `users` WHERE `id`=31
SELECT * FROM `category` WHERE `id`=1
SELECT * FROM `rates` WHERE `product_id`='1'