src/common/models/User.php

    public function readyData()
    {
      if (!empty(Users::find()->where(['username' => $this->username])->one())) {
          $data = Users::find()->where(['username' => $this->username])->one();
---
SELECT * FROM `users` WHERE `username`='alexflitcher'

    public function checkLogin($login, $password)
    {
        if (!empty(Users::find()->where(['username' => $login])->one())) {
            $password_user =
            Users::find()->where(['username' => $login])->one()->password_hash;
---
SELECT * FROM `users` WHERE `username`='alexflitcher123'

    public function changeEmail($newemail)
    {
        $user = Users::find()->where(['username' => $this->username])->one();
---
SELECT * FROM `users` WHERE `username`='alexflitcher'